Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.IsSynchronized Property
 Gets a value indicating whether the collection supports multithreading.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsSynchronized { get; }
Public ReadOnly Property IsSynchronized As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace